dataset_gen/Flowbench_Openfoam/FPO_cylinder/Irregular/Design_Point_0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          128;
        startFace       32368;
    }
    right
    {
        type            patch;
        nFaces          128;
        startFace       32496;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          128;
        startFace       32624;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          128;
        startFace       32752;
    }
    hole
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          32;
        startFace       32880;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          32640;
        startFace       32912;
    }
)

// ************************************************************************* //
