dataset_gen/Flowbench_Openfoam/FPO_cylinder/Irregular/Design_Point_0/0/T
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 310; // Fixed temperature for the bottom wall (e.g., 310 K)
    }
    top
    {
        type            fixedValue;
        value           uniform 300; // Fixed temperature for the top wall (e.g., 300 K)
    }
    hole
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
