dataset_gen/Flowbench_Openfoam/FPO_cylinder/Irregular/Design_Point_0/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-3;      // relaxed from 1e-4
        relTol          0.1;
    }

    "(U|e).*"
    {
        $p;
        tolerance       1e-3;      // relaxed from 1e-4
        relTol          0.1;
    }

    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-3;      // relaxed from 1e-4
        relTol          0.1;
    }
}

PIMPLE
{
    nOuterCorrectors         2;   // reduced from 3
    nCorrectors              1;
    nNonOrthogonalCorrectors 0;
    transonic                yes;
}


// ************************************************************************* //
